app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 12 Sep 2013 19:51:43 UTC +00:00], ["text", "This is a test."], ["title", "Test"], ["updated_at", Thu, 12 Sep 2013 19:51:43 UTC +00:00]]

  def show
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."id" ASC LIMIT 1  [["id", 2]]

  def update
    @post = Post.find(params[:id])

    if @post.update(params[:post].permit(:title, :text))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "7"]]
UPDATE "posts" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "posts"."id" = 3  [["title", "Not the third post"], ["text", "This was the third post, but then a prior post was deleted."], ["updated_at", Sat, 14 Sep 2013 01:08:32 UTC +00:00]]